import pickle
shops= {
"Пятерочка": {"Понедельник": 120000, "Вторник": 135000, "Среда": 128000,
 "Четверг": 142000, "Пятница": 185000, "Суббота": 210000,
"Воскресенье": 195000},

"Магнит": {"Понедельник": 98000, "Вторник": 105000, "Среда": 92000,
 "Четверг": 110000, "Пятница": 145000, "Суббота": 168000,
"Воскресенье": 155000},

"Грошык": {"Понедельник": 100000, "Вторник": 80000, "Среда": 102000,
 "Четверг": 137000, "Пятница": 150000, "Суббота": 130000,
"Воскресенье": 200000},

"Копеечка": {"Понедельник": 145000, "Вторник": 162000, "Среда": 127000,
 "Четверг": 242000, "Пятница": 105000, "Суббота": 200000,
"Воскресенье": 191000},

"Евроопт": {"Понедельник": 149000, "Вторник": 102000, "Среда": 121000,
 "Четверг": 142000, "Пятница": 195000, "Суббота": 205000,
"Воскресенье": 210000},

"Алми": {"Понедельник": 200000, "Вторник": 110000, "Среда": 150000,
 "Четверг": 139000, "Пятница": 155000, "Суббота": 110000,
"Воскресенье": 195000},

"Маяк": {"Понедельник": 200000, "Вторник": 195000, "Среда": 158000,
 "Четверг": 132000, "Пятница": 165000, "Суббота": 190000,
"Воскресенье": 201000}
}
averages={}
for shop, days in shops.items():
  avg=sum(days.values())/len(days)
  averages[shop]=avg
  print (f"{shop}: средняя выручка {avg:.2f}")

max_shop=max(averages,key=averages.get)
min_shop=min(averages, key=averages.get)
print(f"\nМаксимальная средняя выручка {max_shop} ({averages[max_shop]})")
print(f"Минимальная средняя выручка {min_shop} ({averages[min_shop]})")

print("\nНеблагоприятные дни ")
for shop,days in shops.items():
 bad_day=min(days, key=days.get)
 print(f"{shop}: {bad_day} ({days[bad_day]})")

print("\nМагазины с воскресной выручкой > средней на 20%:")
for shop, days in shops.items():
    if days["Воскресенье"] > averages[shop] * 1.2:
        print(f"{shop}: воскресенье {days['Воскресенье']} > {averages[shop]}")

with open("data.pickle", "wb") as f:
    pickle.dump(shops, f)


with open("input.txt", "r", encoding="utf-8") as f:
    lines = f.readlines()

lines_sorted = sorted(lines, key=lambda line: len(line.split()))

with open("output.txt", "w", encoding="utf-8") as f:
    f.writelines(lines_sorted)
